#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_iam_role.eks_cluster_role: Refreshing state... [id=eks-cluster-role]
aws_eip.nat_b: Refreshing state... [id=eipalloc-09dc9de650c8e59bf]
aws_eip.nat_a: Refreshing state... [id=eipalloc-0e9e06d65ac607761]
aws_vpc.eks_vpc: Refreshing state... [id=vpc-0b6f0475637144b2f]
aws_iam_role.eks_node_role: Refreshing state... [id=eks-node-role]
aws_iam_role_policy_attachment.eks_cluster_policy: Refreshing state... [id=eks-cluster-role/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
aws_iam_instance_profile.eks_node_instance_profile: Refreshing state... [id=eks-node-instance-profile]
aws_iam_role_policy_attachment.eks_worker_node_policy: Refreshing state... [id=eks-node-role/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]
aws_iam_role_policy_attachment.eks_container_registry_policy: Refreshing state... [id=eks-node-role/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
aws_iam_role_policy_attachment.eks_cni_policy: Refreshing state... [id=eks-node-role/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
aws_subnet.eks_pr_b: Refreshing state... [id=subnet-02df96236dbd8506a]
aws_subnet.eks_pb_b: Refreshing state... [id=subnet-0b1c7a2a511ee86d2]
aws_subnet.eks_pr_a: Refreshing state... [id=subnet-08dc02f90277a1ae1]
aws_subnet.eks_pb_a: Refreshing state... [id=subnet-07de195a8b8cd379b]
aws_security_group.eks_mgmt_sg: Refreshing state... [id=sg-03980a0f1525e215d]
aws_internet_gateway.eks_igw: Refreshing state... [id=igw-0f421f2bc5d5ad29c]
aws_route_table.public: Refreshing state... [id=rtb-07025532e992604a2]
aws_nat_gateway.nat_gw_a: Refreshing state... [id=nat-05ac9169aff618668]
aws_nat_gateway.nat_gw_b: Refreshing state... [id=nat-0d32978616bd0d5f3]
aws_route_table.private_a: Refreshing state... [id=rtb-0dee18913b00c07b1]
aws_route_table_association.public_b: Refreshing state... [id=rtbassoc-00f33b1daef10b693]
aws_route_table_association.public_a: Refreshing state... [id=rtbassoc-0508e4a8246109761]
aws_route_table.private_b: Refreshing state... [id=rtb-0312ecaac667d76ef]
aws_route_table_association.private_a: Refreshing state... [id=rtbassoc-04df37f9c32501a7a]
aws_route_table_association.private_b: Refreshing state... [id=rtbassoc-0046ae63c0a13f92b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_addon.container_insights will be created
  + resource "aws_eks_addon" "container_insights" {
      + addon_name           = "amazon-cloudwatch-observability"
      + addon_version        = "v1.1.1-eksbuild.1"
      + arn                  = (known after apply)
      + cluster_name         = "my-eks-demo"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + region               = "us-east-1"
      + tags_all             = (known after apply)
    }

  # aws_eks_addon.coredns will be created
  + resource "aws_eks_addon" "coredns" {
      + addon_name           = "coredns"
      + addon_version        = "v1.11.1-eksbuild.4"
      + arn                  = (known after apply)
      + cluster_name         = "my-eks-demo"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + region               = "us-east-1"
      + tags_all             = (known after apply)
    }

  # aws_eks_addon.ebs_csi will be created
  + resource "aws_eks_addon" "ebs_csi" {
      + addon_name           = "aws-ebs-csi-driver"
      + addon_version        = "v1.26.1-eksbuild.1"
      + arn                  = (known after apply)
      + cluster_name         = "my-eks-demo"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + region               = "us-east-1"
      + tags_all             = (known after apply)
    }

  # aws_eks_addon.efs_csi will be created
  + resource "aws_eks_addon" "efs_csi" {
      + addon_name           = "aws-efs-csi-driver"
      + addon_version        = "v1.7.1-eksbuild.1"
      + arn                  = (known after apply)
      + cluster_name         = "my-eks-demo"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + region               = "us-east-1"
      + tags_all             = (known after apply)
    }

  # aws_eks_addon.kube_proxy will be created
  + resource "aws_eks_addon" "kube_proxy" {
      + addon_name           = "kube-proxy"
      + addon_version        = "v1.32.1-eksbuild.1"
      + arn                  = (known after apply)
      + cluster_name         = "my-eks-demo"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + region               = "us-east-1"
      + tags_all             = (known after apply)
    }

  # aws_eks_addon.vpc_cni will be created
  + resource "aws_eks_addon" "vpc_cni" {
      + addon_name           = "vpc-cni"
      + addon_version        = "v1.15.1-eksbuild.1"
      + arn                  = (known after apply)
      + cluster_name         = "my-eks-demo"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + region               = "us-east-1"
      + tags_all             = (known after apply)
    }

  # aws_eks_cluster.my-eks-demo will be created
  + resource "aws_eks_cluster" "my-eks-demo" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = false
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + deletion_protection           = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "my-eks-demo"
      + platform_version              = (known after apply)
      + region                        = "us-east-1"
      + role_arn                      = "arn:aws:iam::851725311521:role/eks-cluster-role"
      + status                        = (known after apply)
      + tags_all                      = (known after apply)
      + version                       = "1.32"

      + access_config {
          + authentication_mode                         = "API_AND_CONFIG_MAP"
          + bootstrap_cluster_creator_admin_permissions = true
        }

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)

          + elastic_load_balancing {
              + enabled = (known after apply)
            }
        }

      + upgrade_policy {
          + support_type = "STANDARD"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = [
              + "subnet-02df96236dbd8506a",
              + "subnet-08dc02f90277a1ae1",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.my-eks-ng will be created
  + resource "aws_eks_node_group" "my-eks-ng" {
      + ami_type               = "AL2023_x86_64_STANDARD"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "my-eks-demo"
      + disk_size              = 20
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "my-eks-ng"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::851725311521:role/eks-node-role"
      + region                 = "us-east-1"
      + release_version        = "1.32.7-20250807"
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-02df96236dbd8506a",
          + "subnet-08dc02f90277a1ae1",
        ]
      + tags_all               = (known after apply)
      + version                = "1.32"

      + node_repair_config {
          + enabled = false
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 2
          + min_size     = 2
        }

      + timeouts {
          + create = "15m"
          + delete = "15m"
          + update = "15m"
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_instance.my-eks-mgmt will be created
  + resource "aws_instance" "my-eks-mgmt" {
      + ami                                  = "ami-0de716d6197524dd9"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "us-east-1b"
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + force_destroy                        = false
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "us-east-1"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0b1c7a2a511ee86d2"
      + tags                                 = {
          + "Name" = "my-eks-mgmt"
        }
      + tags_all                             = {
          + "Name" = "my-eks-mgmt"
        }
      + tenancy                              = (known after apply)
      + user_data                            = <<-EOT
            #!/bin/bash
            set -e
            
            yum update -y
            yum install -y curl unzip jq bash-completion
            
            curl -LO https://s3.us-west-2.amazonaws.com/amazon-eks/1.32.3/2025-04-17/bin/linux/amd64/kubectl
            chmod +x kubectl
            mv kubectl /usr/local/bin/
            kubectl version --client || echo "kubectl install failed"
            
            curl -fsSL https://raw.githubusercontent.com/helm/helm/main/scripts/get-helm-3 | bash
            helm version || echo "helm install failed"
            
            kubectl completion bash > /etc/bash_completion.d/kubectl
            helm completion bash > /etc/bash_completion.d/helm
        EOT
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-03980a0f1525e215d",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = false
          + iops                  = 3000
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = 125
          + volume_id             = (known after apply)
          + volume_size           = 8
          + volume_type           = "gp3"
        }
    }

  # aws_security_group.eks_cluster_sg will be created
  + resource "aws_security_group" "eks_cluster_sg" {
      + arn                    = (known after apply)
      + description            = "EKS Cluster Security Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.16.0.0/16",
                ]
              + description      = "Allow Kubernetes API from VPC"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "172.16.0.0/16",
                ]
              + description      = "Allow node communication from VPC"
              + from_port        = 10250
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 10250
            },
        ]
      + name                   = "eks-cluster-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "eks-cluster-sg"
        }
      + tags_all               = {
          + "Name" = "eks-cluster-sg"
        }
      + vpc_id                 = "vpc-0b6f0475637144b2f"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @anuragrai63, Action: `pull_request`*